Repository: millysecurity/dankbot
Catalog: serverstats/locales/*.po
Languages: fr_fr

source: That option is only available for the bot owner.
fr_fr: Cette option n'est disponible que pour le propriétaire du bot.

source: Gather useful information about servers the bot is in A lot of commands are bot owner only
fr_fr: Regroupe des informations utiles sur les serveurs dans lesquels se trouve le bot Beaucoup de commandes ne sont disponibles que pour le propriétaire du bot

source: Display a users avatar in chat
fr_fr: Affiche l'avatar d'un utilisateur dans le chat

source: That user does not appear to exist on this server.
fr_fr: Cet utilisateur ne semble pas être sur ce serveur.

source: {bot} has joined a server! That's **{num}** servers now! That's a total of **{users}** users ! Server created on **{since}**. That's over **{passed}** days ago!
fr_fr: {bot} a rejoint un serveur ! Cela fait **{num}** serveurs maintenant ! Ce qui fait un total de **{users}** utilisateurs ! Serveur créer le **{since}**. C'était il y a **{passed}** jours !

source: Created on **{since}**. That's over **{passed}** days ago!
fr_fr: Créer le **{since}**. C'était il y a **{passed}** jours !

source: **{bot_name}** joined this server on **{bot_join}**. That's over **{since_join}** days ago!
fr_fr: **{bot_name}** a rejoint ce serveur le **{bot_join}**. C'était il y a **{since_join}** jours !

source: Members :
fr_fr: Membres :

source: Total users : **{total}** Lurkers : **{lurkers}** Humans : **{hum}** • Bots : **{bots}** 📗 `{online}` 📙 `{idle}` 📕 `{dnd}` 📓 `{off}` 🎥 `{streaming}` 📱 `{mobile}`
fr_fr: Total utilisateurs : **{total}** Lecture seulement : **{lurkers}** Humains : **{hum}** • Bots : **{bots}** 📗 `{online}` 📙 `{idle}` 📕 `{dnd}` 📓 `{off}` 🎥 `{streaming}` 📱 `{mobile}`

source: Total users : **{total}** Humans : **{hum}** • Bots : **{bots}** 📗 `{online}` 📙 `{idle}` 📕 `{dnd}` 📓 `{off}` 🎥 `{streaming}` 📱 `{mobile}`
fr_fr: Total utilisateurs : **{total}** Humains : **{hum}** • Bots : **{bots}** 📗 `{online}` 📙 `{idle}` 📕 `{dnd}` 📓 `{off}` 🎥 `{streaming}` 📱 `{mobile}`

source: Channels :
fr_fr: Salons :

source: 💬 Text : **{text}** 🔊 Voice : **{voice}**
fr_fr: 💬 Texte : **{text}** 🔊 Voix : **{voice}**

source: Utility :
fr_fr: Utilitaire :

source: Owner : {owner.mention} **{owner}** Region : **{region}** Verif. level : **{verif}** Server ID : **{id}**
fr_fr: Propriétaire : {owner.mention} **{owner}** Région : **{region}** Niveau de vérif. : **{verif}** ID Serveur : **{id}**

source: Misc :
fr_fr: Divers :

source: AFK channel : **{afk_chan}** AFK Timeout : **{afk_timeout}sec** Custom emojis : **{emojis}** Roles : **{roles}**
fr_fr: Salon AFK : **{afk_chan}** Délai AFK : **{afk_timeout}sec** Emojis du serveur : **{emojis}** Rôles : **{roles}**

source: Special features :
fr_fr: Caractéristiques spéciales :

source: {vip} VIP Regions {van} Vanity URL {splash} Splash Invite {m_emojis} More Emojis {verify} Verified
fr_fr: {vip} Régions VIP {van} URL Personaliser {splash} Image d'invitation {m_emojis} Plus d'emojis {verify} Vérifié

source: {bot} has left a server! That's **{num}** servers now! That's a total of **{users}** users ! Server created on **{since}**. That's over **{passed}** days ago!
fr_fr: {bot} a quitté un serveur ! Cela fait **{num}** serveurs maintenant ! Ce qui fait un total de **{users}** utilisateurs ! Serveur créer le **{since}**. C'était il y a **{passed}** jours !

source: Post a large size emojis in chat
fr_fr: Envoi un émoji en grande taille dans le chat

source: That doesn't appear to be a valid emoji
fr_fr: Ça ne semble pas être un émoji valide.

source: Sets a specified channels topic `channel` is optional and if not supplied will use the current channel Note: The maximum number of characters is 1024
fr_fr: Définit le sujet d'un salon spécifié `channel` est optionnel et s'il n'est pas spécifié, il utilisera le salon actuel Remarque : Le nombre maximum de caractères est de 1024.

source: I require the "Manage Channels" permission to execute that command.
fr_fr: J'ai besoin de la permission "Gérer les salons" pour pouvoir exécuter cette commande.

source: Please provide a reinvite link/message. Type `exit` for no invite link/message.
fr_fr: Veuillez fournir un lien/message de réinvitation. Tapez `exit` pour aucun lien/message d'invitation.

source: I Guess not.
fr_fr: Je suppose que non.

source: Perform various actions on users who haven't spoken in x days Note: This will only check if a user has talked in the past x days whereas discords built in Prune checks online status
fr_fr: Effectuer diverses actions sur les utilisateurs qui n'ont pas parlé depuis x jours Note : Ceci ne vérifiera que si un utilisateur à parlé au cours des x derniers jours alors que la fonction `Purger` de Discord vérifie si un utilisateur est en ligne

source: List the users who have not talked in x days
fr_fr: Liste les utilisateurs qui n'ont pas parlé depuis x jours

source: Role
fr_fr: Rôle

source: Discord Estimate
fr_fr: Estimation de Discord

source: Estimated members to be pruned
fr_fr: Estimation du nombre de membres qui peuvent être purgés

source: Discord Estimate: {estimate}
fr_fr: Estimation de Discord : {estimate}

source: Role: {role.name}
fr_fr: Rôle : {role.name}

source: Estimated members to be pruned {num_members} {role} {members}
fr_fr: Estimation du nombre de membres qui peuvent être purgés {num_members} {role} {members}

source: Kick users from the server who have been inactive for x days `days` is the number of days since last seen talking on the server `role` is the specified role you would like to kick defaults to everyone `reinvite` True/False whether to try to send the user a message before kicking
fr_fr: Expulser les utilisateurs du serveur qui ont été inactifs pendant x jours `days` est le nombre de jours depuis la dernière fois qu'un utilisateur à été vu écrire sur le serveur `role` est le rôle spécifié que vous aimeriez utiliser pour expulser par défaut tout le monde `reinvite` True/False pour savoir s'il faut essayer d'envoyer un message à l'utilisateur avant de l'expulser

source: That role is higher than my role so I cannot kick those members.
fr_fr: Ce rôle est au-dessus du miens, donc je ne peux pas expluser ses membres.

source: estimated users to kick. Would you like to kick them?
fr_fr: utilisateurs estimés à être expulsés. Est-ce que vous voulez les expulser ?

source: I guess not.
fr_fr: Je suppose que non.

source: Kicked due to inactivity.
fr_fr: Expulsé pour cause d'inactivité.

source: users could not be DM'd an invite link
fr_fr: utilisateurs qui n'ont pas pu être contacté en message privé pour un lien d'invitation

source: Done.
fr_fr: Terminé.

source: Give roles to users who haven't spoken in x days `days` is the number of days since last seen talking on the server `new_roles` The new roles to apply to a user who is inactive
fr_fr: Attribuer des rôles aux utilisateurs qui n'ont pas parlé depuis x jours `days` est le nombre de jours depuis la dernière fois qu'un utilisateur à été vu écrire sur le serveur `new_roles` Les nouveaux rôles à attribuer à un utilisateur inactif

source: At least one of those roles is higher than my role so I cannot add those roles.
fr_fr: Au moins un de ces rôles est plus haut que le mien, je ne peux donc pas ajouter ces rôles.

source: estimated users to give the role. Would you like to reassign their roles now?
fr_fr: utilisateurs estimés pour attribuer le rôle. Voulez-vous réassigner leur rôles maintenant ?

source: Given role due to inactivity.
fr_fr: Rôle attribué pour cause d'inactivité.

source: Remove roles from users who haven't spoken in x days `days` is the number of days since last seen talking on the server `role` is the specified role you would like to remove roles defaults to everyone `removed_roles` the roles to remove from inactive users
fr_fr: Supprimer le rôle des utilisateurs qui n'ont pas parlé depuis x jours `days` est le nombre de jours depuis la dernière fois qu'un utilisateur à été vu écrire sur le serveur `role` est le rôle spécifié que vous voulez pour supprimer les rôles par défaut `removed_roles` les rôles à supprimer des utilisateurs inactifs

source: At least one of those roles is higher than my role so I cannot remove those roles.
fr_fr: Au moins un de ces rôles est plus haut que le mien, je ne peux donc pas les supprimer.

source: estimated users to remove their roles. Would you like to reassign their roles now?
fr_fr: utilisateurs estimés pour supprimer le rôle. Voulez-vous réassigner leurs rôles maintenant ?

source: Roles removed due to inactivity.
fr_fr: Rôles supprimés pour cause d'inactivité.

source: Set a channel to see new servers the bot is joining
fr_fr: Définit un salon pour voir les nouveaux serveurs que le bot rejoint

source: Posting new servers and left servers in
fr_fr: Affichage des nouveaux serveurs et ceux quittés dans

source: Stop bots join/leave server messages
fr_fr: Arrête l'affichage des messages lorsque le bot rejoint ou quitte un serveur

source: No longer posting joined or left servers.
fr_fr: Je ne vais plus affiché de messages lorsque le bot rejoint ou quitte un serveur.

source: Checks for possible cheaters abusing the global bank and server powers
fr_fr: Vérification des tricheurs potentiels abusant des pouvoirs de la banque globale et du serveur

source: is guild owner of
fr_fr: est le propriétaire du serveur

source: Not a cheater
fr_fr: Ce n'est pas un tricheur

source: Display servers a user shares with the bot `member` can be a user ID or mention
fr_fr: Affiche les serveurs qu'un utilisateur partage avec le bot `member` peut être l'ID d'un utilisateur ou aussi une mention

source: doesn't seem to be a discord user.
fr_fr: ne semble pas être un utilisateur Discord.

source: is on:
fr_fr: est sur :

source: is not in any shared servers!
fr_fr: n'est sur aucun serveurs partagés !

source: Lists servers by number of users and shows number of users
fr_fr: Liste les serveurs par nombre d'utilisateurs et affiche le nombre d'utilisateurs

source: Lists servers by when the bot was added to the server
fr_fr: Liste les serveurs en fonction de la date à laquelle le bot a été ajouté au serveur

source: Set a channels slowmode setting `time` must be a number between 0 and 120 `channel` is the channel you want to set slowmode on defaults to current channel
fr_fr: Réglage du slowmode des salons `time` doit être un nombre compris entre 0 et 120 `channel` est le salon où vous voulez définir le slowmode, par défaut sur le salon actuel

source: You can only set a number between 0 and 120
fr_fr: Vous ne pouvez définir qu'un nombre entre 0 et 120

source: Slowmode set to `{time}` in {channel}
fr_fr: Slowmode définit sur `{time}` dans {channel}

source: Edit various guild settings
fr_fr: Définir divers paramètres de serveur

source: Change the server name
fr_fr: Changer le nom du serveur

source: Requested by {author}
fr_fr: Demandé par {author}

source: Modify the guilds verification level `level` must be one of: `none`, `low`, `medium`, `table flip`(`high`), or `double table flip`(`extreme`)
fr_fr: Modifie le niveau de vérification du serveur `level` doit être l'un des : `none`, `low`, `medium`, `table flip`(`high`), ou `double table flip`(`extreme`)

source: `{}` is not a proper verification level.
fr_fr: `{}` n'est pas un niveau de vérification approprié.

source: Change the system channel This is the default discord welcome channel.
fr_fr: Changer le salon de message de bienvenue C'est le salon de message de bienvenue par défaut.

source: Change the servers AFK voice channel Defaults to no AFK channel.
fr_fr: Changer le salon vocal AFK du serveur Par défaut il n'y en a pas.

source: Change the servers AFK timeout `timeout` must be a value of 60, 300, 900, 1800, or 3600.
fr_fr: Changer le délai avant inactivité d'AFK du serveur `timeout` doit être une valeur de 60, 300, 900, 1800, ou 3600.

source: `timeout` must be a value of 60, 300, 900, 1800, or 3600.
fr_fr: `timeout` doit être une valeur de 60, 300, 900, 1800, ou 3600.

source: Lists top members on the server by join date `number` optional[int] number of members to display at a time maximum of 50 `guild` can be either the server ID or name
fr_fr: Liste les membres du serveur par date d'arrivée `number` nombre optionnel, nombre de membres à afficher à la fois, maximum de 50 `guild` peut être l'ID ou le nom du serveur

source: First
fr_fr: Premier

source: members of
fr_fr: membres de

source: first members
fr_fr: premiers membres

source: Lists channels and their position and ID for a server `guild` can be either the server ID or name
fr_fr: Liste les salons et leurs position et leur ID pour un serveur `guild` peut être l'ID ou le nom du serveur

source: I cannot find or create an invite for `{guild}`
fr_fr: Je ne peux pas trouver ou créé une invitation pour `{guild}`

source: Are you sure you want to leave {guild}? (reply yes or no)
fr_fr: Êtes-vous sûr(e) de quitter le serveur {guild} ? (Répondez par yes ou no)

source: Leaving {guild}.
fr_fr: Je quitte le serveur {guild}.

source: I couldn't leave {guild}.
fr_fr: Je ne peux pas quitter le serveur {guild}.

source: Okay, not leaving {guild}.
fr_fr: D'accord, je ne quitte pas le serveur {guild}.

source: Display info about servers the bot is on `guild_name` can be either the server ID or partial name
fr_fr: Affiche les informations des serveurs sur lesquels le bot est `guild_name` peut être l'ID ou un nom partiel

source: Display number of users on a server `guild_name` can be either the server ID or partial name
fr_fr: Affiche le nombre d'utilisateurs d'un serveur `guild_name` peut être l'ID ou un nom partiel

source: Displays all roles their ID and number of members in order of hierarchy `guild_name` can be either the server ID or partial name
fr_fr: Affiche tout les rôles, leur ID et le nombre de membres dans l'ordre suivant la hiérarchie du serveur `guild_name` peut être l'ID ou un nom partiel

source: Roles
fr_fr: Rôles

source: Gets a list of all reactions from specified message and displays the user ID, Username, and Discriminator and the emoji name.
fr_fr: Obtient une liste de toutes les réactions à partir d'un message spécifié, et affiche l'ID utilisateur, son nom d'utilisateur, son tag et le nom de l'emoji

source: Gets total messages on the server and displays each channel separately as well as the user who has posted the most in each channel `limit` must be a number of messages to check, defaults to all messages Note: This is a very slow function and may take some time to complete
fr_fr: Obtient le total des messages du serveur, et affiche chaque salons séparément ainsi que l'utilisateur qui a envoyé le plus de messages dans chaque salons `limit` doit être un nombre de messages à vérifier, par défaut tous les messages sont affichés Remarque : Il s'agit d'une fonction très lente qui peut prendre un certain temps avant d'être terminée.

source: This might take a while!
fr_fr: Cela pourrait prendre un certain temps !

source: most posts by
fr_fr: le plus de messages par

source: Total Messages:
fr_fr: Total des messages :

source: Most posts by
fr_fr: Le plus de messages par

source: Most posts on the server
fr_fr: La plupart des messages sur le serveur

source: Most posts (continued)
fr_fr: La plupart des messages (suite)

source: Members List
fr_fr: Liste des membres

source: Gets total messages in a specific channel as well as the user who has posted the most in that channel `limit` must be a number of messages to check, defaults to all messages Note: This can be a very slow function and may take some time to complete
fr_fr: Obtient le total des messages dans un salon spécifié ainsi que l'utilisateur qui a envoyer le plus de messages dans ce salon `limit` doit être un nombre de messages à vérifier, par défaut tous les messages sont affichés Remarque : Il s'agit d'une fonction très lente qui peut prendre un certain temps avant d'être terminée.

source: Most posts in {channel.name}
fr_fr: Le plus de messages dans {channel.name}

source: Display all server emojis in a menu that can be scrolled through `id_emojis` return the id of emojis. Default to False, set True `guild_name` can be either the server ID or partial name
fr_fr: Affiche tout les emojis du serveur dans un menu `id_emojis` donne l'ID des emojis. Par défaut sur False, définissez True `guild_name` peut être l'ID ou un nom partiel
